Repository: ikhlasulov-gb/open-rpm-gtk
Catalog: po/*.po
Languages: id, ru

# menu.shortcuts
source: Keyboard Shortcuts
id: Pintasan Keyboard
ru: Комбинации клавиш

# menu.about
source: About Open RPM
id: Tentang Open RPM
ru: О приложении Open RPM

# menu.quit
source: Quit
id: Keluar
ru: Выход

# error.prefix
source: Error:
id: Kesalahan:
ru: Ошибка:

# error.py.missing
source: Python 3 is not installed on the system.
id: Python 3 tidak terinstal di sistem.
ru: Python 3 не установлен в системе.

# error.gi.missing
source: PyGObject library (gi) not found.
id: Library PyGObject (gi) tidak ditemukan.
ru: Библиотека PyGObject (gi) не найдена.

# error.window.missing
source: File scripts/window.py not found.
id: File scripts/window.py tidak ditemukan.
ru: Файл scripts/window.py не найден.

# error.locale.missing
source: Locale file not found:
id: File lokalisasi tidak ditemukan:
ru: Файл локализации не найден:

# error.locale.fallback.missing
source: Fallback locale file not found:
id: File lokalisasi fallback tidak ditemukan:
ru: Резервный файл локализации не найден:

# error.locale.key.missing
source: Localization key not found:
id: Kunci lokalisasi tidak ditemukan:
ru: Ключ локализации не найден:

# log.monitor.resolution
source: Monitor resolution: {screen_width}px, scale: {scale_factor:.2f}, window: {window_width}x{window_height}
id: Resolusi monitor: {screen_width}px, skala: {scale_factor:.2f}, jendela: {window_width}x{window_height}
ru: Разрешение монитора: {screen_width}px, масштаб: {scale_factor:.2f}, окно: {window_width}x{window_height}

# log.selected_age
source: Selected age: {selected_age}
id: Usia yang dipilih: {selected_age}
ru: Выбранный возраст: {selected_age}

# log.test_start
source: Starting test...
id: Memulai tes...
ru: Запуск теста...

# test.question
source: Question
id: Pertanyaan
ru: Вопрос

# result.stats
source: Statistics
id: Statistik
ru: Статистика

# result.series_title
source: Series Results
id: Hasil Seri
ru: Результаты по сериям

# result.series_template
source: Series {s}
id: Seri {s}
ru: Серия {s}

# result.diagnosis
source: Diagnosis
ru: Диагноз

# result.reliability
source: Reliability
id: Keandalan
ru: Надёжность

# result.degree
source: Degree
id: Tingkat
ru: Степень

# result.status
source: Status
ru: Статус

# result.recommendation
source: Recommendations
id: Rekomendasi
ru: Рекомендации

# app.title
source: Raven's Test
id: Tes Raven
ru: Тест Равена

# app.subtitle
source: Raven's Progressive Matrices (RPM)
id: Matriks Progresif Raven (RPM)
ru: Прогрессивные матрицы Равена (RPM)

# intro.instruction_title
source: Instruction:
id: Instruksi:
ru: Инструкция:

# intro.instruction_text
source: You will be offered 60 tasks (5 series). Find the logical pattern and select the missing piece.
id: Anda akan diberikan 60 tugas (5 seri). Temukan pola logis dan pilih bagian yang hilang.
ru: Вам будут предложены 60 заданий (5 серий). Найдите логическую закономерность и выберите недостающий фрагмент.

# intro.time
source: Time: 20 minutes.
id: Waktu: 20 menit.
ru: Время: 20 минут.

# intro.age
source: Age:
id: Usia:
ru: Возраст:

# intro.start_button
source: Start
id: Mulai
ru: Начать

# age.14_30
source: 14 - 30 years
id: 14 - 30 tahun
ru: 14 - 30 лет

# age.31_35
source: 31 - 35 years
id: 31 - 35 tahun
ru: 31 - 35 лет

# age.36_40
source: 36 - 40 years
id: 36 - 40 tahun
ru: 36 - 40 лет

# age.41_45
source: 41 - 45 years
id: 41 - 45 tahun
ru: 41 - 45 лет

# age.46_50
source: 46 - 50 years
id: 46 - 50 tahun
ru: 46 - 50 лет

# age.51_55
source: 51 - 55 years
id: 51 - 55 tahun
ru: 51 - 55 лет

# age.56_plus
source: 56+ years
id: 56+ tahun
ru: 56+ лет

# test.progress_template
source: Question {q} of 60 (Series {s})
id: Pertanyaan {q} dari 60 (Seri {s})
ru: Вопрос {q} из 60 (Серия {s})

# test.prev
source: Back
id: Kembali
ru: Назад

# test.next
source: Next
id: Berikutnya
ru: Далее

# test.finish
source: Finish
id: Selesai
ru: Завершить

# test.end
source: End
id: Akhiri
ru: Закончить

# test.series
source: Series
id: Seri
ru: Серия

# confirm.title
source: End?
id: Akhiri?
ru: Закончить?

# confirm.message
source: End early? Only completed questions will be counted.
id: Akhiri lebih awal? Hanya pertanyaan yang diselesaikan yang akan dihitung.
ru: Закончить досрочно? Будут учтены только пройденные вопросы.

# confirm.cancel
source: Cancel
id: Batal
ru: Отмена

# confirm.end
source: Yes
id: Ya
ru: Да

# result.results_title
source: Results
id: Hasil
ru: Результаты

# result.label
source: Result
id: Hasil
ru: Результат

# result.age
source: Age
id: Usia
ru: Возраст

# result.total_score
source: Score
id: Nilai
ru: Балл

# result.time_taken
source: Time
id: Waktu
ru: Время

# result.series
source: Series
id: Seri
ru: Серия

# result.correct
source: Correct
id: Benar
ru: Верно

# result.deviation
source: Deviation
id: Deviasi
ru: Отклонение

# result.return
source: Return
id: Kembali
ru: Вернуться

# result.interpretation
source: Interpretation
id: Interpretasi
ru: Интерпретация

# result.analysis
source: Analysis &amp; Advice
id: Analisis &amp; Saran
ru: Анализ и советы

# diag.exceptional
source: Exceptional, Outstanding Intelligence
id: Inteligensi Luar Biasa, Menonjol
ru: Исключительный, Выдающийся интеллект

# diag.high
source: High Intelligence Level
id: Tingkat Inteligensi Tinggi
ru: Высокий уровень интеллекта

# diag.above_avg
source: Above Average Intelligence
id: Inteligensi Di Atas Rata-rata
ru: Выше среднего интеллект

# diag.avg
source: Average Intelligence Level
id: Tingkat Inteligensi Rata-rata
ru: Средний уровень интеллекта

# diag.below_avg
source: Below Average Intelligence
id: Inteligensi Di Bawah Rata-rata
ru: Ниже среднего интеллект

# diag.low
source: Low Intelligence Level
id: Tingkat Inteligensi Rendah
ru: Низкий уровень интеллекта

# diag.mild
source: Mild Mental Deficiency
id: Kekurangan Mental Ringan
ru: Лёгкая умственная отсталость

# diag.moderate
source: Moderate Mental Deficiency
id: Kekurangan Mental Sedang
ru: Умеренная умственная отсталость

# diag.severe
source: Severe Mental Deficiency
id: Kekurangan Mental Berat
ru: Тяжёлая умственная отсталость

# reliability.good
source: Reliable result.
id: Hasil yang dapat diandalkan.
ru: Надёжный результат.

# reliability.unreliable
source: Significant deviations across series. Results may be unreliable.
id: Deviasi signifikan di seluruh seri. Hasil mungkin tidak dapat diandalkan.
ru: Значительные отклонения по сериям. Результаты могут быть ненадёжными.

# reliability.defect
source: Significant deviation in Series A. Possible attention deficit.
id: Deviasi signifikan di Seri A. Kemungkinan defisit perhatian.
ru: Значительное отклонение в серии A. Возможный дефицит внимания.

# reliability.low_reliability
source: Low score. Low indicators are considered less reliable.
id: Nilai rendah. Indikator rendah dianggap kurang dapat diandalkan.
ru: Низкий балл. Низкие показатели считаются менее надёжными.

# degree.1
source: 95%+ (Degree 1): Exceptionally Highly Developed Intelligence
id: 95%+ (Derajat 1): Inteligensi Sangat Berkembang Luar Biasa
ru: 95%+ (Степень 1): Исключительно высокоразвитый интеллект

# degree.2
source: 75% - 95% (Degree 2): Exceptional Intelligence
id: 75% - 95% (Derajat 2): Inteligensi Luar Biasa
ru: 75% - 95% (Степень 2): Исключительный интеллект

# degree.3
source: 25% - 74% (Degree 3): Average Intelligence
id: 25% - 74% (Derajat 3): Inteligensi Rata-rata
ru: 25% - 74% (Степень 3): Средний интеллект

# degree.4
source: 5% - 24% (Degree 4): Below Average Intelligence
id: 5% - 24% (Derajat 4): Inteligensi Di Bawah Rata-rata
ru: 5% - 24% (Степень 4): Ниже среднего интеллект

# degree.5
source: 5% or less (Degree 5): Defective Intellectual Capacity
id: 5% atau kurang (Derajat 5): Kapasitas Intelektual Cacat
ru: 5% или менее (Степень 5): Дефектное интеллектуальное развитие

# rec.120
source: Exceptional potential. You excel at pattern recognition. Engage in strategy, math, or architecture. Challenges satisfy you.
id: Potensi luar biasa. Anda unggul dalam pengenalan pola. Terlibat dalam strategi, matematika, atau arsitektur. Tantangan memuaskan Anda.
ru: Исключительный потенциал. Вы превосходно распознаёте паттерны. Займитесь стратегией, математикой или архитектурой. Задачи приносят удовлетворение.

# rec.110
source: Above average abilities. You process info quickly. Try learning languages, coding, or chess. Suited for analytical roles.
id: Kemampuan di atas rata-rata. Anda memproses informasi dengan cepat. Coba pelajari bahasa, coding, atau catur. Cocok untuk peran analitis.
ru: Способности выше среднего. Вы быстро обрабатываете информацию. Попробуйте изучение языков, программирование или шахматы. Подходит для аналитических ролей.

# rec.90
source: Average intelligence. You can learn any skill with practice. Regular practice, reading, and puzzles keep the mind sharp. Solid foundation for any career.
id: Inteligensi rata-rata. Anda dapat mempelajari keterampilan apa pun dengan latihan. Latihan teratur, membaca, dan teka-teki menjaga pikiran tetap tajam. Fondasi yang solid untuk karir apa pun.
ru: Средний интеллект. Вы можете освоить любой навык с практикой. Регулярная практика, чтение и головоломки поддерживают ум в тонусе. Надёжная основа для любой карьеры.

# rec.80
source: Slightly below average. Abstract concepts may be hard; practical tasks easier. Brain exercises (Sudoku) can help improve speed.
id: Sedikit di bawah rata-rata. Konsep abstrak mungkin sulit; tugas praktis lebih mudah. Latihan otak (Sudoku) dapat membantu meningkatkan kecepatan.
ru: Немного ниже среднего. Абстрактные концепции могут быть трудными; практические задачи легче. Упражнения для мозга (судоку) могут помочь улучшить скорость.

# rec.low
source: Difficulty with patterns. Doesn't define your worth. Focus on hands-on tasks. Consult a specialist for tailored cognitive training.
id: Kesulitan dengan pola. Tidak mendefinisikan nilai Anda. Fokus pada tugas praktis. Konsultasikan dengan spesialis untuk pelatihan kognitif yang disesuaikan.
ru: Трудности с паттернами. Это не определяет вашу ценность. Сосредоточьтесь на практических задачах. Проконсультируйтесь со специалистом для индивидуальной когнитивной тренировки.

source: translator-credits
id: penerjemah
ru: переводчики

# about.report_issue
source: Report Issue
id: Laporkan Masalah
ru: Сообщить о проблеме

# about.thanks
source: Thanks to These Projects
id: Terima Kasih Kepada
ru: Благодарности

# app.description
source: A modern implementation of Raven's Progressive Matrices (RPM) - a standardized non-verbal intelligence test
id: Implementasi modern dari Tes Matriks Progresif Raven (RPM) - tes kecerdasan non-verbal yang terstandarisasi
ru: Современная реализация теста прогрессивных матриц Равена (RPM) - стандартизированного невербального теста интеллекта

# about.comments
source: A modern IQ testing application based on Raven's Progressive Matrices.
id: Aplikasi pengujian IQ modern berdasarkan Matriks Progresif Raven.
ru: Современное приложение для тестирования IQ на основе прогрессивных матриц Равена.

# Shortcuts
source: Keyboard Shortcuts
id: Pintasan Keyboard
ru: Комбинации клавиш

# shortcut window
source: Quit
id: Keluar
ru: Выход
